[
  {
    "id": "1",
    "slug": "pecahnya-perang-1825",
    "title": "Pecahnya Perang Jawa",
    "year": "20 Juli 1825",
    "location": "Tegalrejo, Yogyakarta",
    "coordinates": { "x": "45%", "y": "60%" },
    "figures": ["Pangeran Diponegoro", "Patih Danurejo IV", "Residen Smissaert"],
    "narrative": "Ketegangan memuncak ketika Belanda memasang patok di atas tanah makam leluhur Pangeran Diponegoro di Tegalrejo tanpa izin. Ini bukan sekadar sengketa tanah, melainkan puncak dari akumulasi kekecewaan terhadap campur tangan kolonial dalam adat keraton dan penderitaan rakyat akibat pajak.",
    "tactics": "Belanda mengirim pasukan untuk menangkap Pangeran, namun Pangeran dan pengikutnya telah bersiap dan meloloskan diri ke Gua Selarong untuk menyusun strategi gerilya.",
    "impact": "Menandai dimulainya perang terbuka yang akan berlangsung selama 5 tahun dan menguras kas Belanda.",
    "quote": "Sadumuk bathuk, sanyari bumi ditohi tekan pati. (Sejari kepala, sejengkal tanah dibela sampai mati.)",
    "image_caption": "Ilustrasi pasukan Belanda mengepung kediaman Tegalrejo.",
    "references": ["Babad Diponegoro", "Sejarah Nasional Indonesia Jilid IV"]
  },
  {
    "id": "2",
    "slug": "pertempuran-lengkong-1826",
    "title": "Pertempuran Lengkong",
    "year": "30 Juli 1826",
    "location": "Sleman, Yogyakarta",
    "coordinates": { "x": "43%", "y": "58%" },
    "figures": ["Pangeran Diponegoro", "Sentot Alibasyah"],
    "narrative": "Salah satu pertempuran terbuka terbesar di mana pasukan Diponegoro menunjukkan keunggulan taktik kavaleri dan infanteri. Pasukan Belanda mengalami kerugian besar dan moral pasukan Jawa sedang di puncaknya.",
    "tactics": "Serangan mendadak (raid) dan penggunaan parit perlindungan alami.",
    "impact": "Kemenangan ini memperluas pengaruh Diponegoro ke wilayah Kedu dan Bagelen.",
    "quote": "Semangat pasukan kita sedang menyala-nyala seperti api membakar alang-alang.",
    "image_caption": "Sketsa pertempuran sengit di area persawahan.",
    "references": ["Peter Carey, Kuasa Ramalan"]
  },
  {
    "id": "3",
    "slug": "benteng-stelsel-1827",
    "title": "Penerapan Benteng Stelsel",
    "year": "1827",
    "location": "Jawa Tengah & DIY",
    "coordinates": { "x": "50%", "y": "50%" },
    "figures": ["Jenderal De Kock"],
    "narrative": "Menyadari sulitnya melawan taktik 'hit and run' Diponegoro, Jenderal De Kock mengubah strategi. Setiap wilayah yang direbut dibangun benteng pertahanan dan dihubungkan dengan jalan raya. Ini mempersempit ruang gerak gerilyawan secara drastis.",
    "tactics": "Isolasi wilayah, pembatasan logistik, dan pemecahan konsentrasi pasukan musuh.",
    "impact": "Pasukan Diponegoro mulai terdesak dan terpecah-pecah, kesulitan komunikasi antar komandan.",
    "quote": "Kita harus menjepit mereka, bukan mengejar bayangan di hutan.",
    "image_caption": "Peta jaringan benteng Belanda yang dibangun tahun 1827.",
    "references": ["Sejarah Perang Jawa", "De Kock's Journal"]
  },
  {
    "id": "4",
    "slug": "penangkapan-kyai-mojo-1828",
    "title": "Tertangkapnya Kyai Mojo",
    "year": "12 November 1828",
    "location": "Mlangi, Sleman",
    "coordinates": { "x": "44%", "y": "59%" },
    "figures": ["Kyai Mojo", "Pangeran Diponegoro"],
    "narrative": "Kyai Mojo, pemimpin spiritual dan penasihat utama, berhasil ditangkap Belanda melalui negosiasi yang buntu. Kehilangan Kyai Mojo adalah pukulan telak bagi moral pasukan santri yang menjadi tulang punggung perlawanan.",
    "tactics": "Politik adu domba dan negosiasi palsu.",
    "impact": "Kekuatan religius pasukan Diponegoro melemah signifikan.",
    "quote": "Perjuangan ini bukan hanya soal tanah, tapi soal tegaknya agama.",
    "image_caption": "Lukisan Kyai Mojo dibawa ke pengasingan.",
    "references": ["Ricklefs, Sejarah Indonesia Modern"]
  },
  {
    "id": "5",
    "slug": "penangkapan-diponegoro-1830",
    "title": "Pengkhianatan di Magelang",
    "year": "28 Maret 1830",
    "location": "Karesidenan Magelang",
    "coordinates": { "x": "40%", "y": "55%" },
    "figures": ["Pangeran Diponegoro", "Jenderal De Kock"],
    "narrative": "Pangeran Diponegoro setuju bertemu Jenderal De Kock untuk negosiasi damai saat bulan Ramadhan. Namun, Belanda memanfaatkan momen ini untuk menangkapnya. Sang Pangeran tidak melawan demi menghindari pertumpahan darah lebih lanjut.",
    "tactics": "Tipu muslihat diplomatik.",
    "impact": "Berakhirnya Perang Jawa. Belanda mengukuhkan kekuasaan mutlak di Jawa, namun menderita kebangkrutan yang memicu sistem Tanam Paksa (Cultuurstelsel).",
    "quote": "Saya tidak takut mati, tapi saya tidak sudi harga diri saya diinjak-injak dengan cara licik seperti ini.",
    "image_caption": "Lukisan Raden Saleh: Penangkapan Pangeran Diponegoro.",
    "references": ["Babad Diponegoro", "Lukisan Raden Saleh"]
  }
]
